# GetParameters Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyManager..::..GetParameters Method
FamilyManager Class See Also
---
Gets the parameters associated to family types in order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<FamilyParameter> GetParameters()
```

Visual Basic
---
```text
Public Function GetParameters As IList(Of FamilyParameter)
```

Visual C++
---
```text
public:
IList<FamilyParameter^>^ GetParameters()
```

# ### Return Value
A collection containing all family parameters.
# Remarks
The parameters are family built-in parameters, category built-in parameters and shared parameters associated to the family types.
The collection consists of both visible and invisible parameters associated to the family types.
The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.
Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
# See Also
FamilyManager Class
Autodesk.Revit.DB Namespace